In [1]:
# Import Packages

import pandas as pd
import numpy
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [2]:
# Storing all the file names from the directory

directory = 'data'
files = []

for filename in os.listdir(directory):
    f = os.path.join(directory,filename)
    if os.path.isfile(f):
        files.append(f)
        print(f)

data\jkt2011.json
data\jkt2012.json
data\jkt2013.json
data\jkt2014.json
data\jkt2015.json
data\jkt2016.json
data\jkt2017.json
data\jkt2018.json
data\jkt2019.json

In [3]:
# Concatenating the json files into one DataFrame

df = pd.DataFrame()

for f in files:
    df = pd.concat([df,pd.read_json(f)])

In [4]:
# Checking the data by sampling

df.sample(5)

,tahun,nama_kabupaten_kota,nama_kecamatan,jumlah_kelurahan,jumlah_rw,jumlah_rt,jumlah_kk,jumlah _kk
15,2012,Jakarta Utara,Kelapa Gading,3,68,706,53069.0,NaN
15,2011,Jakarta Utara,Kelapa Gading,3,67,698,40909.0,NaN
6,2013,Jakarta Pusat,Cempaka Putih,3,30,375,29067.0,NaN
7,2016,Jakarta Pusat,Menteng,5,38,425,29838.0,NaN
30,2012,Jakarta Selatan,Kebayoran Baru,10,66,656,49084.0,NaN

In [5]:
# Checking the DataFrame info

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 396 entries, 0 to 43
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   tahun                396 non-null    int64
 1   nama_kabupaten_kota  396 non-null    object
 2   nama_kecamatan       396 non-null    object
 3   jumlah_kelurahan     396 non-null    int64
 4   jumlah_rw            396 non-null    int64
 5   jumlah_rt            396 non-null    int64
 6   jumlah_kk            352 non-null    float64
 7   jumlah _kk           44 non-null     float64
dtypes: float64(2), int64(4), object(2)
memory usage: 27.8+ KB

In [6]:
# Filling in the null values in the separated columns

df['jumlah_kk'].fillna(df['jumlah _kk'], inplace=True)

In [7]:
# Dropping the redundant column from the DataFrame

df.drop(columns=['jumlah _kk'], inplace=True)

In [8]:
# Making sure no other issues can be found

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 396 entries, 0 to 43
Data columns (total 7 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   tahun                396 non-null    int64
 1   nama_kabupaten_kota  396 non-null    object
 2   nama_kecamatan       396 non-null    object
 3   jumlah_kelurahan     396 non-null    int64
 4   jumlah_rw            396 non-null    int64
 5   jumlah_rt            396 non-null    int64
 6   jumlah_kk            396 non-null    float64
dtypes: float64(1), int64(4), object(2)
memory usage: 24.8+ KB

In [9]:
# Final checking on some descriptive statistics before exporting

df.describe()

             tahun  jumlah_kelurahan   jumlah_rw    jumlah_rt      jumlah_kk
count   396.000000        396.000000  396.000000   396.000000     396.000000
mean   2015.000000          6.068182   62.017677   694.368687   74804.724747
std       2.585255          1.726311   21.217790   265.151412   36367.978000
min    2011.000000          3.000000   11.000000    47.000000    2460.000000
25%    2013.000000          5.000000   48.750000   515.000000   46661.250000
50%    2015.000000          6.000000   62.000000   673.000000   72165.500000
75%    2017.000000          7.000000   77.000000   893.250000   96573.250000
max    2019.000000         11.000000  104.000000  1277.000000  186058.000000

In [17]:
df['nama_kecamatan'] = df['nama_kecamatan'].apply(lambda x: x.strip())

In [20]:
df['nama_kecamatan'].value_counts(dropna=False).sort_values(ascending=True)

Kalideres                   1
Setiabudi                   2
Setia Budi                  7
Kali Deres                  8
Koja                        9
Senen                       9
Cempaka Putih               9
Menteng                     9
Tanah Abang                 9
Johar Baru                  9
Penjaringan                 9
Kebon Jeruk                 9
Cilincing                   9
Pademangan                  9
Kelapa Gading               9
Cengkareng                  9
Grogol Petamburan           9
Taman Sari                  9
Tambora                     9
Gambir                      9
Kemayoran                   9
Tanjung Priok               9
Sawah Besar                 9
Kepulauan Seribu Selatan    9
Cipayung                    9
Palmerah                    9
Tebet                       9
Mampang Prapatan            9
Pasar Minggu                9
Kebayoran Lama              9
Cilandak                    9
Kebayoran Baru              9
Pancoran                    9
Jagakarsa                   9
Pesanggrahan                9
Matraman                    9
Pulo Gadung                 9
Jatinegara                  9
Kramat Jati                 9
Pasar Rebo                  9
Cakung                      9
Duren Sawit                 9
Makasar                     9
Ciracas                     9
Kepulauan Seribu Utara      9
Kembangan                   9
Name: nama_kecamatan, dtype: int64

In [23]:
df['nama_kecamatan'] = df['nama_kecamatan'].apply(lambda x: 'Kalideres' if x=='Kali Deres' else('Setiabudi' if x=='Setia Budi' else x))

In [24]:
# Exporting the file as a csv

df.to_csv('dataset.csv', index=False)